n = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
https://www.youtube.com/watch?v=CxU4ROAYGzs
https://habr.com/ru/articles/212235/

1) Initial Permutation
state = [
[0, 4, 8, 12],
[1, 5, 9, 13],
[2, 6, 10, 14],
[3, 7, 11, 15]]

2) SubBytes
sbox_s = [
[10, 14, 13, 5, 9, 7, 0, 6, 15, 4, 11, 8, 2, 12, 1, 3],
[0, 2, 11, 6, 8, 10, 5, 13, 15, 9, 12, 7, 1, 3, 14, 4],
[9, 3, 13, 5, 7, 11, 8, 6, 2, 4, 14, 15, 12, 0, 1, 10],
[7, 8, 5, 15, 11, 3, 9, 6, 2, 12, 1, 4, 14, 0, 10, 13],
[13, 12, 5, 15, 4, 0, 10, 9, 7, 8, 3, 2, 11, 6, 1, 14]
]

Для sbox_s[0] число 0 заменить на sbox_s[0][0].
Использовать sbox_s[0] для round #0.

Так выглядит state после раунда #0:
[[10, 9, 15, 2],
[14, 7, 4, 12],
[13, 0, 11, 1],
[5, 6, 8, 3]]

3) ShiftRows

[[10, 9, 15, 2],
[7, 4, 12, 14],
[11, 1, 13, 0],
[3, 5, 6, 8]]

4) MixColumns

[[21, 26, 1, 30],
[26, 7, 6, 22],
[30, 0, 19, 20],
[20, 20, 28, 24]]

5) AddRoundKey

Пусть sbox_s будет вместо round_key.
round_key #0 = sbox_s[0]

[[31, 20, 12, 27],
[19, 0, 6, 16],
[17, 4, 24, 28],
[22, 24, 29, 27]]
